In [1]:
import pandas as pd

In [2]:
json = open ('dadoos/aluguel.json')
print(json.read())

[{"Tipo":"Quitinete","Bairro":"Copacabana","Quartos":1,"Vagas":0,"Suites":0,"Area":40,"Valor":1700.0,"Condominio":500.0,"IPTU":60.0},
{"Tipo":"Casa","Bairro":"Jardim Bot\u00e2nico","Quartos":2,"Vagas":0,"Suites":1,"Area":100,"Valor":7000.0,"Condominio":null,"IPTU":null},
{"Tipo":"Conjunto Comercial\/Sala","Bairro":"Barra da Tijuca","Quartos":0,"Vagas":4,"Suites":0,"Area":150,"Valor":5200.0,"Condominio":4020.0,"IPTU":1111.0},
{"Tipo":"Apartamento","Bairro":"Centro","Quartos":1,"Vagas":0,"Suites":0,"Area":15,"Valor":800.0,"Condominio":390.0,"IPTU":20.0},
{"Tipo":"Apartamento","Bairro":"Higien\u00f3polis","Quartos":1,"Vagas":0,"Suites":0,"Area":48,"Valor":800.0,"Condominio":230.0,"IPTU":null},
{"Tipo":"Apartamento","Bairro":"Vista Alegre","Quartos":3,"Vagas":1,"Suites":0,"Area":70,"Valor":1200.0,"Condominio":null,"IPTU":null},
{"Tipo":"Apartamento","Bairro":"Cachambi","Quartos":2,"Vagas":0,"Suites":0,"Area":50,"Valor":1300.0,"Condominio":301.0,"IPTU":17.0},
{"Tipo":"Casa de Condom\u00ednio","Bairro":"Barra da Tijuca","Quartos":5,"Vagas":4,"Suites":5,"Area":750,"Valor":22000.0,"Condominio":null,"IPTU":null},
{"Tipo":"Casa de Condom\u00ednio","Bairro":"Ramos","Quartos":2,"Vagas":2,"Suites":0,"Area":65,"Valor":1000.0,"Condominio":null,"IPTU":null},
{"Tipo":"Conjunto Comercial\/Sala","Bairro":"Centro","Quartos":0,"Vagas":3,"Suites":0,"Area":695,"Valor":35000.0,"Condominio":19193.0,"IPTU":3030.0}]

In [3]:
df_json = pd.read_json('dadoos/aluguel.json')
df_json

,Area,Bairro,Condominio,IPTU,Quartos,Suites,Tipo,Vagas,Valor
0,40,Copacabana,500.0,60.0,1,0,Quitinete,0,1700
1,100,Jardim Botânico,NaN,NaN,2,1,Casa,0,7000
2,150,Barra da Tijuca,4020.0,1111.0,0,0,Conjunto Comercial/Sala,4,5200
3,15,Centro,390.0,20.0,1,0,Apartamento,0,800
4,48,Higienópolis,230.0,NaN,1,0,Apartamento,0,800
5,70,Vista Alegre,NaN,NaN,3,0,Apartamento,1,1200
6,50,Cachambi,301.0,17.0,2,0,Apartamento,0,1300
7,750,Barra da Tijuca,NaN,NaN,5,5,Casa de Condomínio,4,22000
8,65,Ramos,NaN,NaN,2,0,Casa de Condomínio,2,1000
9,695,Centro,19193.0,3030.0,0,0,Conjunto Comercial/Sala,3,35000

In [4]:
txt = open ('dadoos/aluguel.txt')
print (txt.read())

Tipo	Bairro	Quartos	Vagas	Suites	Area	Valor	Condominio	IPTU
Quitinete	Copacabana	1	0	0	40	1700	500	60
Casa	Jardim BotÃ¢nico	2	0	1	100	7000
Conjunto Comercial/Sala	Barra da Tijuca	0	4	0	150	5200	4020	1111
Apartamento	Centro	1	0	0	15	800	390	20
Apartamento	HigienÃ³polis	1	0	0	48	800	230
Apartamento	Vista Alegre	3	1	0	70	1200
Apartamento	Cachambi	2	0	0	50	1300	301	17
Casa de CondomÃ­nio	Barra da Tijuca	5	4	5	750	22000
Casa de CondomÃ­nio	Ramos	2	2	0	65	1000
Conjunto Comercial/Sala	Centro	0	3	0	695	35000	19193	3030

In [5]:
df_txt = pd.read_table ('dadoos/aluguel.txt')
df_txt

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800,230.0,NaN
5,Apartamento,Vista Alegre,3,1,0,70,1200,NaN,NaN
6,Apartamento,Cachambi,2,0,0,50,1300,301.0,17.0
7,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000,NaN,NaN
8,Casa de Condomínio,Ramos,2,2,0,65,1000,NaN,NaN
9,Conjunto Comercial/Sala,Centro,0,3,0,695,35000,19193.0,3030.0

In [6]:
df_html = pd.read_html

In [7]:
!pip install lxml

Requirement already satisfied: lxml in c:\users\daniel\anaconda3\envs\alura_pandas\lib\site-packages (4.9.3)

In [8]:
!pip install html5lib

Requirement already satisfied: html5lib in c:\users\daniel\anaconda3\envs\alura_pandas\lib\site-packages (1.1)
Requirement already satisfied: webencodings in c:\users\daniel\anaconda3\envs\alura_pandas\lib\site-packages (from html5lib) (0.5.1)
Requirement already satisfied: six>=1.9 in c:\users\daniel\anaconda3\envs\alura_pandas\lib\site-packages (from html5lib) (1.16.0)

In [9]:
df_html = pd.read_html('dadoos/dados_html_1.html')
df_html[0]

  FAIXA ETÁRIA UNAFISCO SAÚDE SOFT II SOFT PARTICIPATIVO     UNIQUE
0      00 A 18               R$218,99           R$192,60    R$334,48
1      19 A 23               R$263,63           R$207,67    R$380,06
2      24 A 28               R$322,44           R$224,26    R$464,39
3      29 A 33               R$402,05           R$258,63    R$566,68
4      34 A 38               R$455,17           R$306,37    R$664,61
5      39 A 43               R$489,29           R$417,93    R$742,72
6      44 A 48               R$582,65           R$495,24    R$869,47
7      49 A 53               R$718,86           R$562,64  R$1.046,29
8      54 A 58               R$908,54           R$721,00  R$1.355,74
9   59 OU MAIS             R$1.244,50         R$1.151,62  R$2.003,53

In [10]:
df_html = pd.read_html('dadoos/dados_html_2.html')
df_html[0]

,Date,Reserve balances required,Reserve balances maintained 4,Unnamed: 3_level_0,Unnamed: 4_level_0,Unnamed: 5_level_0,Unnamed: 6_level_0
,Reserve balance \n\nrequirements 1,Top of penalty- \n\nfree band 2,Bottom of penalty- \n\nfree band 3,Total,Balances \n\nmaintained to \n\nsatisfy reserve \n\nbalance \n\nrequirements 5,Balances \n\nmaintained that \n\nexceed the top of \n\nthe penalty- \n\nfree band 6,Unnamed: 6_level_1
0,Month 7,NaN,NaN,NaN,NaN,NaN,NaN
1,Apr. 2017,113224.0,124561.0,101890.0,2281420.0,124219.0,2157202.0
2,May 2017,115464.0,127023.0,103906.0,2225769.0,126547.0,2099222.0
3,June 2017,118187.0,130018.0,106357.0,2206547.0,129695.0,2076852.0
4,July 2017,120636.0,132712.0,108561.0,2233323.0,132296.0,2101027.0
5,Aug. 2017,120091.0,132113.0,108071.0,2344015.0,131641.0,2212375.0
6,Sept. 2017,122109.0,134332.0,109887.0,2295735.0,133950.0,2161785.0
7,Oct. 2017,116873.0,128574.0,105176.0,2245701.0,128204.0,2117497.0
8,Nov. 2017,123141.0,135467.0,110816.0,2314455.0,134981.0,2179474.0
9,Dec. 2017,123720.0,136103.0,111337.0,2244274.0,135719.0,2108555.0
10,Jan. 2018,126792.0,139484.0,114101.0,2214601.0,138807.0,2075794.0
11,Feb. 2018,124006.0,136420.0,111594.0,2238775.0,135786.0,2102989.0
12,Mar. 2018,120285.0,132326.0,108245.0,2167009.0,131778.0,2035232.0
13,Apr. 2018,126415.0,139070.0,113762.0,2086192.0,138481.0,1947710.0
14,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15,Two weeks ending 8,NaN,NaN,NaN,NaN,NaN,NaN
16,"Mar. 14, 2018",118515.0,130379.0,106652.0,2228423.0,129881.0,2098542.0
17,"Mar. 28, 2018",121797.0,133989.0,109606.0,2118454.0,133368.0,1985086.0
18,"Apr. 11, 2018",121488.0,133650.0,109327.0,2107005.0,133207.0,1973798.0
19,"Apr. 25, 2018",128536.0,141404.0,115671.0,2096990.0,140741.0,1956249.0
20,"May 9, 2018",131316.0,144460.0,118174.0,2010167.0,143758.0,1866409.0

In [11]:
len (df_html)

3

In [12]:
!pip install xlrd

Requirement already satisfied: xlrd in c:\users\daniel\anaconda3\envs\alura_pandas\lib\site-packages (2.0.1)

In [13]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\daniel\anaconda3\envs\alura_pandas\lib\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\users\daniel\anaconda3\envs\alura_pandas\lib\site-packages (from openpyxl) (1.1.0)

## SERIES

In [14]:
import pandas as pd

In [15]:
data = [1,2,3,4,5]

In [20]:
s= pd.Series(data)

In [21]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [26]:
index = ['linha' + str(i) for i in range(5)]

In [28]:
index

['linha0', 'linha1', 'linha2', 'linha3', 'linha4']

In [32]:
s = pd.Series(data = data , index = index)

In [33]:
s

linha0    1
linha1    2
linha2    3
linha3    4
linha4    5
dtype: int64

In [35]:
data = {'linha' + str(i) : i+1 for i in range (5)}

In [36]:
data

{'linha0': 1, 'linha1': 2, 'linha2': 3, 'linha3': 4, 'linha4': 5}

In [40]:
s=pd.Series(data)

In [41]:
s

linha0    1
linha1    2
linha2    3
linha3    4
linha4    5
dtype: int64

In [42]:
s1 = s + 2

In [43]:
s1

linha0    3
linha1    4
linha2    5
linha3    6
linha4    7
dtype: int64

In [44]:
s2 = s+s1

In [45]:
s2

linha0     4
linha1     6
linha2     8
linha3    10
linha4    12
dtype: int64

## DATA FRAME

In [51]:
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]

In [52]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [53]:
df1 = pd.DataFrame (data=data)

In [54]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [56]:
index = ['linha'+ str(i) for i in range (3)]

In [57]:
index

['linha0', 'linha1', 'linha2']

In [58]:
df1 = pd.DataFrame (data=data, index=index)

In [59]:
df1

        0  1  2
linha0  1  2  3
linha1  4  5  6
linha2  7  8  9

In [60]:
columns = ['coluna' + str (i) for i in range (3)]

In [61]:
columns

['coluna0', 'coluna1', 'coluna2']

In [62]:
df1 = pd.DataFrame (data=data, index=index, columns = columns )

In [63]:
df1

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [64]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [65]:
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [66]:
df2 = pd.DataFrame(data)

In [67]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [101]:
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]

In [102]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [103]:
df3 = pd.DataFrame(data=data, index=index, columns = columns)

In [104]:
df3

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [105]:
df1[df1>0] = 'A'

In [106]:
df1

       coluna0 coluna1 coluna2
linha0       A       A       A
linha1       A       A       A
linha2       A       A       A

In [107]:
df2[df2>0] = 'B'

In [108]:
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [109]:
df3[df3>0] = 'C'

In [110]:
df3

       coluna0 coluna1 coluna2
linha0       C       C       C
linha1       C       C       C
linha2       C       C       C

In [116]:
df4 = pd.concat([df1, df2, df3])
df4

       Coluna0 Coluna1 Coluna2 coluna0 coluna1 coluna2
linha0     NaN     NaN     NaN       A       A       A
linha1     NaN     NaN     NaN       A       A       A
linha2     NaN     NaN     NaN       A       A       A
Linha0       B       B       B     NaN     NaN     NaN
Linha1       B       B       B     NaN     NaN     NaN
Linha2       B       B       B     NaN     NaN     NaN
linha0     NaN     NaN     NaN       C       C       C
linha1     NaN     NaN     NaN       C       C       C
linha2     NaN     NaN     NaN       C       C       C

In [113]:
df4

       Coluna0 Coluna1 Coluna2 coluna0 coluna1 coluna2
linha0     NaN     NaN     NaN       A       A       A
linha1     NaN     NaN     NaN       A       A       A
linha2     NaN     NaN     NaN       A       A       A
Linha0       B       B       B     NaN     NaN     NaN
Linha1       B       B       B     NaN     NaN     NaN
Linha2       B       B       B     NaN     NaN     NaN
linha0     NaN     NaN     NaN       C       C       C
linha1     NaN     NaN     NaN       C       C       C
linha2     NaN     NaN     NaN       C       C       C

In [114]:
df4 = pd.concat ([df1, df2, df3], axis = 1)

In [115]:
df4

       coluna0 coluna1 coluna2 Coluna0 Coluna1 Coluna2 coluna0 coluna1 coluna2
Linha0     NaN     NaN     NaN       B       B       B     NaN     NaN     NaN
Linha1     NaN     NaN     NaN       B       B       B     NaN     NaN     NaN
Linha2     NaN     NaN     NaN       B       B       B     NaN     NaN     NaN
linha0       A       A       A     NaN     NaN     NaN       C       C       C
linha1       A       A       A     NaN     NaN     NaN       C       C       C
linha2       A       A       A     NaN     NaN     NaN       C       C       C

In [117]:
dados = [('A', 'B'), ('C', 'D')]
df = pd.DataFrame(dados, columns = ['L1', 'L2'],  index = ['C1', 'C2'])
df

   L1 L2
C1  A  B
C2  C  D

In [119]:
df1 = pd.DataFrame({'A': {'X': 1}, 'B': {'X': 2}})
df2 = pd.DataFrame({'C': {'X': 3}, 'D': {'X': 4}})
pd.concat([df1, df2])

     A    B    C    D
X  1.0  2.0  NaN  NaN
X  NaN  NaN  3.0  4.0

In [120]:
dados = {'A': {'X': 1, 'Y': 3}, 'B': {'X': 2, 'Y': 4}}
df = pd.DataFrame(dados)
df

   A  B
X  1  2
Y  3  4